"""Червоний, зелений та синій кольори відомі як основні кольори колірної моделі
RGB. При змішуванні червоного та зеленого кольорів, отримується жовтий, при
змішуванні синього і зеленого - блакитний, а при змішуванні синього і
червоного – пурпуровий колір. Напишіть програму, яка запропонує користувачеві
ввести назви двох основних кольорів для змішування. Якщо користувач вводить
щось інше, ніж «червоний», «синій» або «зелений», програма повинна виводити
повідомлення про відсутність такої палітри. В іншому випадку програма повинна
відображати назву кольору, що утворився.
Голомоза Інна Андріївна"""

#Введення данних
color1 = input("Введіть перший основний колір (червоний, зелений, синій): ").lower()
color2 = input("Введіть другий основний колір (червоний, зелений, синій): ").lower()

if color1 == "червоний" and color2 == "зелений" or color2 == "червоний" and color1 == "зелений": 
    result = "жовтий"
elif color1 == "синій" and color2 == "зелений" or color2 == "синій" and color1 == "зелений":
    result = "блакитний"
elif color1 == "червоний" and color2 == "синій" or color2 == "червоний" and color1 == "синій":
    result = "пурпурний"
else:
    result = "Помилка: введені кольори не відповідають палітрі RGB"

#Виведення результату
print(result)


