"""Напишіть програму, у якій користувач вводить значення поточної
дати: день, місяць і рік (цілі числа), а програма виводить вчорашню дату у
форматі: дд.мм.рррр.
Голомоза Інна Андріївна"""

# Введення даних
day = int(input("Введіть день: "))
month = int(input("Введіть місяць: "))
year = int(input("Введіть рік: "))

days_month = [0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31] # Визначення кількості днів у місяці
leap_year = year % 4 == 0 and (year % 100 != 0 or year % 400 == 0) # Перевірка високосного року
if leap_year:
    days_month[2] = 29

if not(1 <= day <= 31) or not (1 <= month <= 12) or year < 1: #Перевірка чи коректні дані
    print("Введені дані некоректні.")
else:    
    day -= 1
    if day == 0:
        month -= 1
    if month == 0:
        month = 12
        year -= 1
    day = days_month[month]

    # Виведення результату
    print(f"Вчорашня дата: {day:02d}.{month:02d}.{year:04d}")
   

